using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;

namespace WindowsFormsApplication1
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void Form1_Load(object sender, EventArgs e)
        {

            //-----------------------------------------------------------------------
            //Пример 1 - Получаем количество секторов на Диске 1.
            //-----------------------------------------------------------------------

            
            LowLevelDisk dd = new LowLevelDisk(1);
            System.Windows.Forms.MessageBox.Show(dd.КолВоСекторовНаДиске.ToString());

            //-----------------------------------------------------------------------
            //Пример 2 - Считываем байты первого сектора диска.
            //-----------------------------------------------------------------------
            byte[] Байты = dd.СчитатьБайты(0, 512);


            //-----------------------------------------------------------------------
            //Пример 3 - Записываем картинку на диск, начиная с 1 сектора (512 байт), 
            //           а затем считываем обратно.
            //-----------------------------------------------------------------------
            //ВНИМАНИЕ! Этот пример изменяет данные на диске, 
            //Тестируйте только на дисках, на которых нет ценных данных.
            //-----------------------------------------------------------------------
            //string ПутьККартинке = "Картинка 1.png";
            //long РазмерКартинки = (new System.IO.FileInfo(ПутьККартинке).Length);

            //dd.ЗаписатьФайлНаДиск(ПутьККартинке, 512);
            //dd.СчитатьФайлСДиска(512, РазмерКартинки, "Картинка 2.png");
            
        }
    }
}
